commands_templates/FindPTZPosition0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/search/wsdl" xmlns:sch="http://www.onvif.org/ver10/schema">
   <soap:Header/>
   <soap:Body>
      <wsdl:FindPTZPosition>
         <!--type: dateTime-->
         <wsdl:StartPoint>?</wsdl:StartPoint>
         <!--Optional:-->
         <!--type: dateTime-->
         <wsdl:EndPoint>?</wsdl:EndPoint>
         <wsdl:Scope>
            <!--Zero or more repetitions:-->
            <sch:IncludedSources Type="http://www.onvif.org/ver10/schema/Receiver">
               <!--type: ReferenceToken-->
               <sch:Token>?</sch:Token>
               <!--You may enter ANY elements at this point-->
            </sch:IncludedSources>
            <!--Zero or more repetitions:-->
            <!--type: RecordingReference-->
            <sch:IncludedRecordings>?</sch:IncludedRecordings>
            <!--Optional:-->
            <!--type: XPathExpression-->
            <sch:RecordingInformationFilter>?</sch:RecordingInformationFilter>
            <!--Optional:-->
            <sch:Extension>
               <!--You may enter ANY elements at this point-->
            </sch:Extension>
         </wsdl:Scope>
         <wsdl:SearchFilter>
            <sch:MinPosition>
               <!--Optional:-->
               <sch:PanTilt x="?" y="?" space="?"/>
               <!--Optional:-->
               <sch:Zoom x="?" space="?"/>
            </sch:MinPosition>
            <sch:MaxPosition>
               <!--Optional:-->
               <sch:PanTilt x="?" y="?" space="?"/>
               <!--Optional:-->
               <sch:Zoom x="?" space="?"/>
            </sch:MaxPosition>
            <!--type: boolean-->
            <sch:EnterOrExit>?</sch:EnterOrExit>
            <!--You may enter ANY elements at this point-->
         </wsdl:SearchFilter>
         <!--Optional:-->
         <!--type: int-->
         <wsdl:MaxMatches>?</wsdl:MaxMatches>
         <!--type: duration-->
         <wsdl:KeepAliveTime>?</wsdl:KeepAliveTime>
      </wsdl:FindPTZPosition>
   </soap:Body>
</soap:Envelope>